In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('./resources/Berlin_Marathon_data_1974_2019.csv')

df = pd.DataFrame(data)

C:\Users\solan\AppData\Local\Temp\ipykernel_3956\3486490049.py:1: DtypeWarning: Columns (1,3) have mixed types. Specify dtype option on import or set low_memory=False.
  data=pd.read_csv('./resources/Berlin_Marathon_data_1974_2019.csv')

In [3]:
df.head()

   YEAR COUNTRY GENDER AGE      TIME
0  1974     NaN   male  L1  02:44:53
1  1974     NaN   male  L2  02:46:43
2  1974     NaN   male  L2  02:48:08
3  1974     NaN   male   L  02:48:40
4  1974     NaN   male  L1  02:49:01

In [6]:
marathon_df = df[df['YEAR'] == 2019]
marathon_df.head()

        YEAR COUNTRY GENDER   AGE      TIME
854148  2019     ETH   male  35.0  02:01:41
854149  2019     ETH   male  20.0  02:02:48
854150  2019     ETH   male  20.0  02:03:36
854151  2019     KEN   male  30.0  02:06:45
854152  2019     KEN   male  30.0  02:08:07

In [8]:
marathon_df['COUNTRY'].unique()

array(['ETH', 'KEN', 'ERI', 'CHN', 'JPN', 'AUT', 'ITA', 'USA', 'SWE',
       'GBR', 'TUR', 'NED', 'IRL', 'ISR', 'MAR', 'FRA', 'CZE', 'BEL',
       'GER', 'MEX', 'LTU', 'KOR', 'SUI', 'NOR', 'LAT', 'TWN', 'GUA',
       'ROU', 'GRE', 'MGL', 'FIN', 'JOR', 'ZAM', 'ESP', 'PUR', 'HKG',
       'RUS', 'COL', 'CAN', 'UKR', 'RSA', 'ARG', 'CHI', 'HUN', 'SUD',
       'BRA', 'EST', 'AUS', 'ISL', 'POR', 'DEN', 'CRC', 'POL', 'MLT',
       'PER', 'SVK', 'LUX', 'LIB', 'SLO', 'CRO', 'VEN', 'BLR', 'MDA',
       'ECU', 'NZL', 'THA', 'BAH', 'ARM', 'VIE', 'ENG', 'DOM', 'IND',
       'ALG', 'NIR', 'KAZ', 'MAS', 'SRB', 'MKD', 'SIN', 'PAR', 'BOL',
       'URU', 'PAN', 'TAN', 'TUN', 'CMR', 'BIH', 'BAR', 'PLE', 'ESA',
       'INA', 'GAM', 'CYP', 'REU', 'MAC', 'UZB', 'LAO', 'BUL', 'IRI',
       'EGY', 'GHA', 'MON', 'AND', 'ARU', 'ZIM', 'GLP', 'KUW', 'AFG',
       'PHI', 'TOG', 'UGA', 'HON', 'SCO', 'COD', 'NEP', 'SRI', 'SYR',
       'LIE', 'MNE', 'BOT', 'PRK', 'TRI', 'GGY', 'FRO', 'WLS', 'UAE',
       'MDV', 'CAY', 'CUB', 'AZE', 'QAT', 'ALB', 'NCA', 'BER', 'NAM',
       'JAM', 'CGO', 'CUW', 'DJI', 'KSA', 'PAK', 'IRQ', 'SUR', 'MYA',
       'NGR'], dtype=object)

In [10]:
marathon_df.to_csv('output_data/marathon_df')